import sys
import os

# Автоматическое добавление родительской папки проекта в sys.path для устранения проблем импорта
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '..')))

from internal.tasks import run_all_tasks

if __name__ == "__main__":
    print("=================================================================")
    print("Запуск Лабораторной работы №4: Методы Ньютона и Сопряженных Направлений")
    print("=================================================================\n")
    run_all_tasks()
    print("\nВсе симуляции и расчеты графиков успешно завершены!")